Tekla.Structures.Catalogs.ParametricProfileItem.SelectByPrefix(System.String)
Selects the parametric profile item in the profile database using the given prefix.
ProfilePrefix: The prefix of the profile name to be select.
Returns: True on success.

Tekla.Structures.Catalogs.ParametricProfileItem.SelectByProfileName(System.String)
Selects the parametric profile item in the profile database using the given name.
ProfileName: The profile name to be select
Returns: True on success.

Tekla.Structures.Catalogs.ParametricProfileItem.SelectByTypeAndSubtype(System.String,Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum,Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum)
Selects the parametric profile item in the profile database using the given type and subtype.
profileName: The profile name.
type: The profile item type.
subtype: The profile item subtype.
Returns: